In [7]:
import pandas as pd

# read_excel은 xlrd 라이브러리에 의존성이 있음
sample_1 = pd.read_excel('./files/sample_1.xlsx', header=1, skipfooter=2, usecols='A:C')
sample_1.head(3)

  국적코드  성별    입국객수
0  A01  남성  106320
1  A01  여성  191436
2  A31  남성     319

In [6]:
sample_1.tail(3)

  국적코드  성별    입국객수
3  A31  여성      42
4  A18  남성  158912
5  A18  여성  232943

In [8]:
sample_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   국적코드    6 non-null      object
 1   성별      6 non-null      object
 2   입국객수    6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [9]:
# 숫자형 변수에 대한 여러가지 통계량 계산
# 예제에서는 '입국객수'만 숫자형 변수
sample_1.describe()

                입국객수
count       6.000000
mean   114995.333333
std     98105.752006
min        42.000000
25%     26819.250000
50%    132616.000000
75%    183305.000000
max    232943.000000

# 데이터 선택 - Column 기준

In [10]:
sample_1

  국적코드  성별    입국객수
0  A01  남성  106320
1  A01  여성  191436
2  A31  남성     319
3  A31  여성      42
4  A18  남성  158912
5  A18  여성  232943

In [11]:
sample_1['국적코드']

0    A01
1    A01
2    A31
3    A31
4    A18
5    A18
Name: 국적코드, dtype: object

In [13]:
sample_1[['국적코드', '입국객수']]

  국적코드    입국객수
0  A01  106320
1  A01  191436
2  A31     319
3  A31      42
4  A18  158912
5  A18  232943

In [14]:
sample_1['기준년월'] = '2020-10'
sample_1

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2020-10
1  A01  여성  191436  2020-10
2  A31  남성     319  2020-10
3  A31  여성      42  2020-10
4  A18  남성  158912  2020-10
5  A18  여성  232943  2020-10

# 데이터 선택 - Row 기준

In [20]:
# 특정 조건으로 필터링
condition_1 = sample_1['성별'] == '남성'
condition_1

0     True
1    False
2     True
3    False
4     True
5    False
Name: 성별, dtype: bool

In [21]:
sample_1[condition_1]

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2020-10
2  A31  남성     319  2020-10
4  A18  남성  158912  2020-10

In [22]:
condition_2 = sample_1['입국객수'] >= 150000
sample_1[condition_2]

  국적코드  성별    입국객수     기준년월
1  A01  여성  191436  2020-10
4  A18  남성  158912  2020-10
5  A18  여성  232943  2020-10

In [24]:
# 2개 이상의 조건이 모두 충죅되도록 필터링
conditions = condition_1 & condition_2
sample_1[conditions]

  국적코드  성별    입국객수     기준년월
4  A18  남성  158912  2020-10

In [25]:
sample_1[condition_1 & condition_2]

  국적코드  성별    입국객수     기준년월
4  A18  남성  158912  2020-10

In [26]:
# 2개 이상의 조건 중 1개 이상 충족되도록 필터링
sample_1[condition_1 | condition_2]

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2020-10
1  A01  여성  191436  2020-10
2  A31  남성     319  2020-10
4  A18  남성  158912  2020-10
5  A18  여성  232943  2020-10

In [27]:
# 하나의 칼럼에 대해 2개 이상의 조건으로 필터링
conditions = sample_1['국적코드'].isin(['A01', 'A18'])
sample_1[conditions == False]

  국적코드  성별  입국객수     기준년월
2  A31  남성   319  2020-10
3  A31  여성    42  2020-10

# 데이터 선택 - index 기준

In [31]:
# 특정 행을 인덱스로 선택
sample_1[1:4]

  국적코드  성별    입국객수     기준년월
1  A01  여성  191436  2020-10
2  A31  남성     319  2020-10
3  A31  여성      42  2020-10

In [37]:
#label-based indexing
sample_1.loc[[], ['국적코드', '입국객수']]

Empty DataFrame
Columns: [국적코드, 입국객수]
Index: []

In [38]:
# positional indexing
sample_1.iloc[[0, 1, 3], [0, 2]]

  국적코드    입국객수
0  A01  106320
1  A01  191436
3  A31      42